//F2404CDB JOB 'COMPDB2',MSGCLASS=X,CLASS=C,NOTIFY=&SYSUID
//*-------------------------------------------------------------------*
//*      JOB DE COMPILACAO DE PROGRAMA COBOL COM DB2 BATCH            *
//*      NAME = SEU PROGRAMA  -   INSTR = SUA CHAVE
//*-------------------------------------------------------------------*
//         JCLLIB ORDER=GR.GERAL.PROCLIB
//COMPDB2B EXEC DFHCODB2,NAME=F2404DB9,INSTR=F2404
//LKED.SYSIN    DD   *
  NAME F2404DB9(R)
//*
//BIND.SYSTSIN  DD *
DSN  SYSTEM(DB8G)
BIND PLAN(F2404DB9) MEM(F2404DB9) ACT(REP) ISOLATION(CS) -
       LIB('DSN810.DBRMLIB.DATA')
END
//*
