//F2404EX3 JOB 'EXECUT',CLASS=C,MSGCLASS=X,NOTIFY=&SYSUID,TIME=(0,02)
//STEP001  EXEC PGM=F2404P03
//STEPLIB  DD DSN=GR.GERAL.LOADLIB,DISP=SHR
//SYSOUT   DD SYSOUT=*
//ASSINA   DD DSN=GR.F2404.ASSINA,DISP=SHR
//LOGERROS DD DSN=GR.F2404.LOGERROS,DISP=SHR
