//F2404CMP JOB 'COMP COB',CLASS=C,MSGCLASS=X,NOTIFY=&SYSUID
//*************************************************************
//*  JOB UTILIZADO PARA COMPILAR PROGRAMAS COBOL
//*************************************************************
// JCLLIB ORDER=GR.GERAL.PROCLIB
//COBCOMP  EXEC DFHCOBLB,LIB1=GR.F2404,NOME='F2404P14',LIB2=GR.GERAL
//LKED.SYSIN    DD   *
  NAME  F2404P14(R)
