//F2404E13 JOB 'EXECUT',CLASS=C,MSGCLASS=X,NOTIFY=&SYSUID,TIME=(0,01)
//STEP001  EXEC PGM=F2404P13
//STEPLIB  DD DSN=GR.GERAL.LOADLIB,DISP=SHR
//ARQVSAM  DD DSN=GR.F2404.ARQVSAM,DISP=SHR
//SYSIN    DD *
001
007
