//F2404EX8 JOB 'EXECUT',CLASS=C,MSGCLASS=X,NOTIFY=&SYSUID,TIME=(0,01)
//STEP001  EXEC PGM=F2404P08
//STEPLIB  DD DSN=GR.GERAL.LOADLIB,DISP=SHR
//SYSOUT   DD SYSOUT=*
//ARQVSAM  DD DSN=GR.F2404.ARQVSAM,DISP=SHR
//SYSIN    DD *
016EMILIA DE OLIVEIRA  EMILIA@GMAIL.COM    PRIME     01990
