//F2404E14 JOB 'EXECUT',CLASS=C,MSGCLASS=X,NOTIFY=&SYSUID,TIME=(0,01)
//STEP001  EXEC PGM=F2404P14
//STEPLIB  DD DSN=GR.GERAL.LOADLIB,DISP=SHR
//SYSOUT   DD SYSOUT=*
//ARQVSAM  DD DSN=GR.F2404.ARQVSAM,DISP=SHR
//LOGERROS DD DSN=GR.F2404.LOGERROS,DISP=SHR
//SYSIN    DD *
G
032ROSICLAIR%SANTOS    ROSCLA@OUTLOOK.COM  PRIME     01990
