//F2404EX9 JOB 'EXECUT',CLASS=C,MSGCLASS=X,NOTIFY=&SYSUID,TIME=(0,01)
//STEP001  EXEC PGM=F2404APA
//STEPLIB  DD DSN=GR.GERAL.LOADLIB,DISP=SHR
//SYSOUT   DD SYSOUT=*
//ARQVSAM  DD DSN=GR.F2404.ARQVSAM,DISP=SHR
//SYSIN    DD *
018DENISE              DENISEGMAIL.COM     PRIME     01990
