//F2404XXX JOB '',CLASS=C,MSGCLASS=X,NOTIFY=F2404,TIME=(0,01)           00000100
//STEP1    EXEC  PGM=SORT                                               00000200
//SYSOUT   DD    SYSOUT=*                                               00000300
//SORTIN   DD    DSN=GR.F2404.ARQENT,DISP=SHR                           00000400
//SORTOUT  DD    DSN=GR.F2404.ARQSAI2,DISP=SHR                          00000510
//SYSIN    DD    *                                                      00000700
 SORT FIELDS=(21,04,CH,A)                                               00000809
   OUTREC FIELDS=(SEQNUM,03,ZD,START=1,1,71)                            00000909
