//F2404XXX JOB '',CLASS=C,MSGCLASS=X,NOTIFY=F2404,TIME=(0,01)           00000101
//STEP1    EXEC  PGM=SORT                                               00000901
//SYSOUT   DD    SYSOUT=*                                               00001001
//SORTIN   DD    DSN=GR.F2404.ARQENT,DISP=SHR                           00001103
//SORTOUT  DD    DSN=GR.F2404.ARQSAI3,DISP=SHR                          00001207
//SYSIN    DD    *                                                      00001301
 SORT FIELDS=COPY                                                       00001408
  OUTREC IFTHEN=(WHEN=(51,15,CH,EQ,C'COBOL'),OVERLAY=(51:C'COBMF'))     00001509
