      *---------------MENSAGEM DE STATUS DE ERRO DOS PROGRAMAS

       01  WRK-MSG-ERROS.
           05 WRK-DESCRICAO-ERRO         PIC X(030)        VALUE SPACES.
           05 WRK-STATUS-ERRO            PIC 9(002)        VALUE ZEROS.
           05 WRK-PROGRAMA-ERRO          PIC X(008)        VALUE SPACES.
           05 WRK-AREA-ERRO              PIC X(030)        VALUE SPACES.
           05 WRK-ARQUIVO-ERRO           PIC X(008)        VALUE SPACES.
      *     05 REG-LOGS-DATA              PIC 9(008)        VALUE ZEROS.
